import task1_convert_list_to_tuple

# Task 1:
# Напишите программу для преобразования списка в кортеж

print('Task 1: Convert list to tuple:')
task1_convert_list_to_tuple.convert_list_to_tuple()