import task1_convert_list_to_tuple
import task2_change_last_elm_tuple
import task3_sum_tuples_values
import task4_value_in_set_exists

# Task 1:
# Напишите программу для преобразования списка в кортеж
# print('Task 1: Convert list to tuple:')
# task1_convert_list_to_tuple.convert_list_to_tuple()

# Task 2:
# Напишите программу для замены последнего значения кортежей в списке
# Sample list: [(10, 20, 40), (40, 50, 60), (70, 80, 90)]
# Expected Output: [(10, 20, 100), (40, 50, 100), (70, 80, 100)]
# print('\nTask 2: Change last tuple value in the list:')
# task2_change_last_elm_tuple.change_last_tuple_element_in_list(100)

# Task 3:
# Напишите программу для поэлементного вычисления суммы
# заданных кортежей. Результатом должен быть кортеж.
# print('\nTask 3: Calculate sum of tuples values:')
# task3_sum_tuples_values.sum_tuples_elements()

# Task 4:
# Напишите программу, которая проверяет, присутствует ли А в
# наборе или нет. А вводится с клавиатуры
print('\nTask 4: Check if entered value exists in the set:')
task4_value_in_set_exists.check_value_in_set_exists()